export const REF = {
  Maiores: [
    { name: "Dó (C)", f: ["x", 3, 2, 0, 1, 0] },
    { name: "Ré (D)", f: ["x", "x", 0, 2, 3, 2] },
    { name: "Mi (E)", f: [0, 2, 2, 1, 0, 0] },
    { name: "Fá (F)", f: [1, 3, 3, 2, 1, 1] },
    { name: "Sol (G)", f: [3, 2, 0, 0, 0, 3] },
    { name: "Lá (A)", f: ["x", 0, 2, 2, 2, 0] },
  ],
  Menores: [
    { name: "Mim (Em)", f: [0, 2, 2, 0, 0, 0] },
    { name: "Lám (Am)", f: ["x", 0, 2, 2, 1, 0] },
    { name: "Rém (Dm)", f: ["x", "x", 0, 2, 3, 1] },
  ],
  "Com sétima": [
    { name: "Mi7 (E7)", f: [0, 2, 0, 1, 0, 0] },
    { name: "Lá7 (A7)", f: ["x", 0, 2, 0, 2, 0] },
    { name: "Ré7 (D7)", f: ["x", "x", 0, 2, 1, 2] },
    { name: "Sol7 (G7)", f: [3, 2, 0, 0, 0, 1] },
    { name: "Dó7 (C7)", f: ["x", 3, 2, 3, 1, 0] },
    { name: "Si7 (B7)", f: ["x", 2, 1, 2, 0, 2] },
  ],
};
